FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/LPC1768_GPIO.c
    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_Activate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are active as GPIO pins.
 *      Once active, the pins are set to GPIO inputs or outputs.
 *      DEPRECATED
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_Activate(void *aWorkspace, TUInt32 aPortPins)
{
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aPortPins);

    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_Deactivate
 *---------------------------------------------------------------------------*
 * Description:
 *      Declare which pins on the GPIO port are inactive as GPIO pins.
 *      DEPRECATED
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to activate
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_Deactivate(void *aWorkspace, TUInt32 aPortPins)
{
    PARAM_NOT_USED(aWorkspace);
    PARAM_NOT_USED(aPortPins);

    return UEZ_ERROR_NOT_SUPPORTED;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_SetOutputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_SetOutputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;

    // Output mode is set by putting 1's in the IODIR register
    (*p_info->iIODIR) |= aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_SetInputMode
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be input mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be input mode
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_SetInputMode(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;

    // Input mode is set by putting 0's in the IODIR register
    // Make those bits 0
    (*p_info->iIODIR) &= ~aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_Set
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output HIGH.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_Set(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;

    // Set the bits corresponding to those pins
    (*p_info->iIOSET) = aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_Clear
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output LOW.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_Clear(void *aWorkspace, TUInt32 aPortPins)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;

    // Set the bits corresponding to those pins
    (*p_info->iIOCLR) = aPortPins;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_Read
 *---------------------------------------------------------------------------*
 * Description:
 *      Read a group of GPIO pins.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt32 aPortPins           -- Pins to be output HIGH
 *      TUInt32 *aPinsRead          -- Pointer to pins result.
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_Read(
            void *aWorkspace,
            TUInt32 aPortPins,
            TUInt32 *aPinsRead)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;

    // Get the bits
    *aPinsRead = ((*p_info->iIOPIN) & aPortPins);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_SetPull
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pins to be output mode.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_SetPull(
            void *aWorkspace,
            TUInt8 aPortPinIndex,
            T_gpioPull aPull)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;

    // Control the pull up/down/none register for this pin
    if (aPortPinIndex < 16) {
        aPortPinIndex <<= 1;
        *p_info->iPINMODEReg1 =
            (*p_info->iPINMODEReg1 &
                (~(3<<aPortPinIndex))) |
                (aPull << aPortPinIndex);
    } else {
        aPortPinIndex -= 16;
        aPortPinIndex <<= 1;
        *p_info->iPINMODEReg2 =
            (*p_info->iPINMODEReg2 &
                (~(3<<aPortPinIndex))) |
                (aPull << aPortPinIndex);
    }

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC1768_GPIO_SetMux
 *---------------------------------------------------------------------------*
 * Description:
 *      Set pin's mux feature.
 * Inputs:
 *      void *aW                    -- Particular GPIO workspace
 *      TUInt8 aPortPinIndex        -- Index to pin 0-31
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC1768_GPIO_SetMux(
            void *aWorkspace,
            TUInt8 aPortPinIndex,
            T_gpioMux aMux)
{
    T_LPC1768_GPIO_Workspace *p = (T_LPC1768_GPIO_Workspace *)aWorkspace;
    const LPC1768_GPIO_PortInfo *p_info = p->iPortInfo;
    TUInt32 shift;

